menu = {
        "김밥" : {
                "김밥" : 2500,
                "참치김밥" : 3000,
                "돈가스김밥" : 3500,
                "고추참치김밥" : 3500,
                "소고기김밥" : 4500,
                "치즈김밥" : 3000,
                "셀러드김밥" : 2500,
                "꼬마김밥" : 1200,
                "충무김밥" : 20000,
                "꽈리김밥" : 3500,
                "진미김밥" : 3700
                },
        "라면" : {
                "라면" : 4000,
                "치즈라면" : 4500,
                "된장라면" : 4700,
                "떡라면" : 4800,
                "만두라면" : 4500,
                "떡만두라면" : 5000,
                "카레라면" : 4500,
                "해물라면" : 5500,
                "짜장라면" : 4200,
                "비빔라면" : 4200
                },
        "돈가스" : {
                "돈가스" : 8000,
                "치즈돈가스" : 9000,
                "고치돈" : 10000,
                "등심돈가스" : 7500,
                "안심돈가스" : 7500,
                "피카츄돈가스" : 500,
                "새우돈가스" : 7500,
                "대왕돈가스" : 12000,
                "치킨돈가스" : 6000
                },
        "함박스테이크" : 9500,
        "덮밥" : {
                "제육덮밥" : 7000,
                "오므라이스" : 7000,
                "하이라이스" : 7000,
                "오징어덮밥" : 7500,
                "짜장덮밥" : 6500,
                "소고기덮밥" : 8000,
                "카레덮밥" : 6500,
                "돌솥비빔밥" : 7000,
                "김치덮밥" : 6500
                },
        "찌개" : {
                "김치찌개" : 6500,
                "된장찌개" : 6500,
                "순두부찌개" : 6500,
                "내장찌개" : 6500,
                "해물된장찌개" : 8500,
                "부대찌개" : 7800
                },
        "떡볶이" : {
                "떡볶이" : 3000,
                "치즈떡볶이" : 4500,
                "라볶이" : 5000,
                "마약떡볶이" : 99900,
                "컵떡볶이" : 500
                },
        "우동" : {
                "우동" : 3000,
                "튀김우동" : 4500,
                "김치우동" : 4500,
                "유부우동" : 4500
                },
        "육개장" : 6000,
        "알탕" : 7500,
        "갈비탕" : 8000,
        "황태해장국" : 7000,
        "순대국밥" : 5500,
        "명태국밥" : 7000,
        "공기밥" : 1000
        }