-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: localhost    Database: mealkit
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `recipe`
--

DROP TABLE IF EXISTS `recipe`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recipe` (
  `MEALKIT_NAME` text,
  `MEALKIT_CODE` text,
  `COST_PRICE` text,
  `SALES` text,
  `RECIPE_NAME` text,
  `RECIPE_CODE` text,
  `RECIPE_GRAM` text,
  `RECIPE_COST` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recipe`
--

LOCK TABLES `recipe` WRITE;
/*!40000 ALTER TABLE `recipe` DISABLE KEYS */;
INSERT INTO `recipe` VALUES ('떡볶이','a1','1482','4000','떡볶이떡','r1','400','720'),('떡볶이','a1','1482','4000','대파','r2','50','160'),('떡볶이','a1','1482','4000','설탕','r3','20','26.2'),('떡볶이','a1','1482','4000','간장','r4','10','13.8'),('떡볶이','a1','1482','4000','고추장','r5','5','73.5'),('떡볶이','a1','1482','4000','고추가루','r6','5','55'),('떡볶이','a1','1482','4000','어묵','r15','100','433.8'),('로제떡볶이','a2','3639','8000','떡볶이떡','r1','400','720'),('로제떡볶이','a2','3639','8000','대파','r2','50','160'),('로제떡볶이','a2','3639','8000','설탕','r3','5','6.55'),('로제떡볶이','a2','3639','8000','간장','r4','5','6.9'),('로제떡볶이','a2','3639','8000','고추장','r5','10','147'),('로제떡볶이','a2','3639','8000','고추가루','r6','10','110'),('로제떡볶이','a2','3639','8000','양파','r7','100','238'),('로제떡볶이','a2','3639','8000','다진마늘','r8','5','11.9'),('로제떡볶이','a2','3639','8000','체다치즈','r12','20','216.9'),('로제떡볶이','a2','3639','8000','카레가루','r13','5','25'),('로제떡볶이','a2','3639','8000','비엔나소세지','r14','100','630'),('로제떡볶이','a2','3639','8000','어묵','r15','100','433.8'),('로제떡볶이','a2','3639','8000','우유','r16','400','888'),('로제떡볶이','a2','3639','8000','파마산치즈가루','r17','5','45'),('김치찌개','a5','5339','10000','대파','r2','50','160'),('김치찌개','a5','5339','10000','설탕','r3','5','6.55'),('김치찌개','a5','5339','10000','간장','r4','10','13.8'),('김치찌개','a5','5339','10000','고추가루','r6','20','220'),('김치찌개','a5','5339','10000','양파','r7','100','238'),('김치찌개','a5','5339','10000','다진마늘','r8','5','11.9'),('김치찌개','a5','5339','10000','김치','r9','800','984'),('김치찌개','a5','5339','10000','돼지고기','r10','400','3360'),('김치찌개','a5','5339','10000','청양고추','r11','50','345'),('아끼소바','a3','7792','13000','쌀','r18','160','366'),('아끼소바','a3','7792','13000','대파','r2','50','160'),('아끼소바','a3','7792','13000','양파','r7','100','238'),('아끼소바','a3','7792','13000','다진마늘','r8','5','11'),('아끼소바','a3','7792','13000','돼지고기','r10','100','840'),('아끼소바','a3','7792','13000','양배추','r19','100','390'),('아끼소바','a3','7792','13000','당근','r20','60','198'),('아끼소바','a3','7792','13000','표고버섯','r21','230','1702'),('아끼소바','a3','7792','13000','숙주','r22','300','1890'),('아끼소바','a3','7792','13000','새우','r23','30','390'),('아끼소바','a3','7792','13000','참치액젓','r24','10','60'),('아끼소바','a3','7792','13000','아끼소바소스','r25','40','520'),('아끼소바','a3','7792','13000','우동사리면','r26','210','1080'),('봉골레파스타','a4','15065','30000','스파게티면','r27','500','1350'),('봉골레파스타','a4','15065','30000','올리브오일','r28','1','12'),('봉골레파스타','a4','15065','30000','바지락','r29','500','2250'),('봉골레파스타','a4','15065','30000','통마늘','r30','800','6320'),('봉골레파스타','a4','15065','30000','페페로치노','r31','10','1100'),('봉골레파스타','a4','15065','30000','화이트와인','r32','100','4000'),('봉골레파스타','a4','15065','30000','파마산치즈가루','r17','5','45'),('순두부찌개','a6','4724','10000','순두부','r33','100','600'),('순두부찌개','a6','4724','10000','대파','r2','50','160'),('순두부찌개','a6','4724','10000','설탕','r3','5','6'),('순두부찌개','a6','4724','10000','애호박','r34','1','1400'),('순두부찌개','a6','4724','10000','표고버섯','r21','230','1702'),('순두부찌개','a6','4724','10000','고추가루','r6','5','55'),('순두부찌개','a6','4724','10000','양파','r7','100','238'),('순두부찌개','a6','4724','10000','소금','r35','10','19'),('순두부찌개','a6','4724','10000','후추','r36','1','20'),('순두부찌개','a6','4724','10000','식용유','r37','2','7'),('순두부찌개','a6','4724','10000','참치액젓','r24','10','60'),('순두부찌개','a6','4724','10000','청양고추','r11','1','7'),('순두부찌개','a6','4724','10000','고추참치','r38','100','1500');
/*!40000 ALTER TABLE `recipe` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-01-17 10:13:34
